# #这里面括号内的所有内容如果没有特殊说明，写代码时不能代入，若可代入会特殊说明，若括号内无内容，则写代码时不能写东西
# import os
# #第一部分：创建
# f=open(file,mode=,encoding=)#以...模式...编码打开或创建一个文件，注意file后要定义文件类型
# #第二部分：文件类型
# 'r'#只读，（default）
# 'w'#只写，无创建新文件，有则删除原文件并创新文件
# 'x'#只写，无创新文件，有报错
# 'a'#只写，无创建新文件，有则文件最后追加内容
# 'b'#二进制模式（二进制将以字节类型显现），可以存储图片、视频、字符（二进制）类型的文件，注：r，a，w，x加上b，则可进入二进制模式
# 't'#文本模式（default），注：一般不会写因为默认就是，也可以自己手动写，则r，a，w，x加上t
# '+'#读写模式,注：任意r，x，w，a加上+则使其即可读又可写，若有特殊注意后面会补充
# 'r+'#修改模式，使用f.write（）时，直接从光标位置或从头覆盖，注：原文件字节数不会改变，所以可能出现由于原字符部分字节被占用而导致乱码
# #第三部分：文件语法
# f.read()#读出文件中的全部内容，在二进制模式下，括号内填入数字则读取所输入数字个字节，在文本模式下则三字节一读（一字符一读），注:只能读一次，由于光标会随读取移动，移动过的内容不会读出
# f.readline()#读一行，在二进制模式下，括号内填入数字则读取所输入数字个字节，在文本模式下则三字节一读（一字符一读),注:只能读一次，由于光标会随读取移动，移动过的内容不会读出
# for a in f#以文件中的每一行进行循环
# f.seek()#将光标移动至指定位置
# f.write('')#于光标处写入内容，注：若要转行在写上\n即可
# f.flush()#将缓存内容存入硬盘
# f.tell()#返回光标位置，在’r+‘模式中失效
# f.truncate()#删除光标往后的所有内容，输入数字，则保存从开头算起数字个字符（文本模式）/个字节（二进制模式），其他删除
# #另：文件要进行字符替换在’r+‘模式中无法使用tell，故先转换为字符，通过replace语法，替换后再清空原文件，并将转换完的内容放入原文件
# os.remove('')#括号内写文件名，删除指定文件，需引入os库
# #第四部分：编码转换与解码
# #另：通过open语法中的encoding=，来指定打开文件使用的解码编码，不可使用申明（申明只是表示以下代码使用该编码）
# a.encode('')#详见str常用语法注释
# a.decode('')#详见str常用语法注释