# #这里面括号内的所有内容如果没有特殊说明，写代码时不能代入，若可代入会特殊说明，若括号内无内容，则写代码时不能写东西
# #有部分内容解释不清，需等待后续内容学习才能理解，后面有空记得修改
# #第一部分：函数的定义
# def 函数名(参数一,参数二,....,参数n):
#     打包的代码
# return 需要从函数中返回的值 #函数运行后只会运行内部程序并无法将运行结果返回至函数外部，故可用return返回函数运行的结果，（default）返回None，可返回多个值
# #注：可变类型数据传入后可更改，如list，由于传入的是内存地址，而不可变类型数据传入后无法影响外部变量，由于是复制了一份，于新的内存地址生成相同的内容，且仅在函数内生效，即局部变量
# #第二部分：参数类型
# 必备参数（位置参数）：即按顺序填入参数（实参）需与形参一一对应（如果与后面参数类型混用，必须放在最前面）
# 关键字参数：即将形参写入用等号连接实参，可直接指定，无需按顺序（如果与必备参数（位置参数）混用，放在它后面）
# 默认参数：即提前在def中赋予形参一个值格式为形参等于一个值，效果为若不修改则默认参数为该值，当与普通参数混用时，需全部放在最后。
# 不定长参数：（1）args/*args，放于已经写完参数的最后，用来以元组/字符串收集未定义的参数，前者打印时为元组，后者打印为字符串
#           （2）**kwargs，放于已经写完参数的最后，用来以字典收集未定义的参数
# 注：特殊用法为当要将list/dict的值一一对应形参时，可通过函数名称（*list/**dict）来直接放入参数
#    当同时要存入list/dict时*args与**kwargs都要写，否则报错
# #第四部分：嵌套函数
# def 函数名(.......): #主函数
#     打包的代码
#     def 函数名(........): #子函数，只能在函数内部生效，主函数外无法调用
#         打包的代码
#         .......  #函数嵌套尽量不超过三层
# #第五部分：全局与局部变量
# 全局变量：在整个程序生效
# 局部变量：只在一定范围内生效
# 查找顺序：先局部后全局
# global 变量 #表明后面所使用的为全局变量，不建议使用
# #第六部分：匿名函数
# lambda 参数:参数进行的代码 #只能写一行
# #第七部分：高阶函数
# 将一个函数作为参数放入另一个函数或者一个函数输出另一个函数
# #第八部分：函数递归
# 函数内部调用自己 #有最大值，（default）999
# #内置函数
# abs()#求绝对值
# all(可迭代对象)#都为True且都不为0则输出True，否则False
# any(可迭代对象)#存在True或存在不为0则输出True，否则False
# bin()#十转二
# bool()#判断输入值的bool值
# bytearray()#将字节形式的数据转化为可更改的数组，再输出字节形式
# bytes()#生成空字节
# callable()#判断输入内容是否可调用
# chr()#返回输入数字再ascii表中所对应的字符
# dict()#生成空字典
# dir()#返回输入对象的可调用属性，类似help
# divmod(被除数,除数)#返回商与余数
# enumerate(可迭代对象,开始的索引值)#返回列表的索引和元素
# eval()#将字符串形式的list，dict，set，tuple转化为原有类型,并可执行单行代码
# exec()#将字符串类型的代码解译并执行
# exit()#退出程序
# filter(函数,可迭代对象)#将可迭代对象中的每一个值取出，将满足函数关系的滤出
# float()#转化为浮点数
# frozenset(set)#将set变为不可变类型，即除了无法更改，也无法增加和删除
# globals()#以dict形式，显示所有全局变量
# locals()#以dict形式，显示所有局部变量
# hash()#返回对象的hash值
# help()#查看对象用法
# hex()#十转十六
# id()#查看对象的内存地址
# input('提示语')#作为外界的指令接受，以字符形式输出，括号内可写提示语
# int()#转化为整型数
# isinstance(数据,数据类型)#判断对象是否为某种数据类型
# len()#返回对象长度
# list()#生成空列表
# map(函数,可迭代对象)#将可迭代对象的每一个值放入函数处理并返回map的对象
# max()#求最大值
# min()#求最小值
# oct()#十转八
# open()#打开文件，详见文件常用语句注释
# ord()#返回字符对应的ascii码
# print()#打印对象，可以直接打印进文件对应语法为：print（对象，文件名，sep='|',end='',file=文件名指向的变量）
# quit()#退出程序，与exit相同
# range()#生成一个范围
# repr()#返回一个值的字符串形式
# reversed()#反转字符或列表，返回列表的对象
# round(小数,保留小数位)#四舍五入
# set()#生成空集合
# sorted(可迭代对象,取值方式（函数）,升降序（True or False）)#对可迭代对象进行排序，以选取的对象中的对象为标准
# str()#sc空字符串
# sum(可迭代对象)#将列表中的所有值求和
# tuple()#生成空元组
# type()#查询对象数据类型
# zip()#将多个list合一如：[1,2,3]与[1,2,3]结果为[(1,1),(2,2),(3,3)],如果不一一对应，多出来的舍去
# compile(f.read(),'','exec')#将文件中读取的内容转化为代码模块，配合exec（）来解译执行
