# #这里面括号内的所有内容如果没有特殊说明，写代码时不能代入，若可代入会特殊说明，若括号内无内容，则写代码时不能写东西
# a=[]
# import copy
# #第一部分：删
# a.clear()#清空列表
# a.remove()#移除列表指定内容，括号内为指定内容
# #第二部分：增
# a.append()#增加一个内容至列表的最后，括号内为指定内容
# a.insert(self=,__index=)#在列表索引值处插入一个内容，其他内容向后一格，self为插入内容，index为插入地的索引值
# #第三部分：查
# a.index(self=,__start=,__end=)#查找列表中指定内容左数第一个的索引值，self为查找的内容，start为起始位置，end为结束位置
# #第四部分：取
# a[__start=:__end=:__len=]#取出从起始位置到终止位置，按照一定步长的列表中的内容，start为起始位置，end为结束位置，len为步长
# len（a）#返回列表的长度
# #第五部分：改
# a.reverse()#将列表反转
# a.extend([])#将两列表相加a在前，[]在后，括号内填相加列表
# a.sort(reverse=True/False)#只能将数字排序，否则报错，顺序倒序都可，reverse表示是否要倒序，注意reverse=必须写
# a.copy()#浅层复制一个列表，若有嵌套列表，如果一个列表中的嵌套列表修改，另一个也会跟着改
# copy.copy(a)#浅层复制一个列表，若有嵌套列表，如果一个列表中的嵌套列表修改，另一个也会跟着改,需要引入copy库
# copy.deepcopy(a)#深层复制一个列表，若有嵌套列表，如果一个列表中的嵌套列表修改，另一个不会跟着改,需要引入copy库
# #第六部分：列表生成式
# n=[放入列表元素及要求 for 循环次数 if 条件]#生成一个列表，详情可看for与while循环语句文件夹中的抽奖.py作为例子，每一项空格隔开
# n=list('')#将字符以每一个索引为单位分割并变为表格